<template>
  <!-- <div v-loading="!data" id="agreement" v-html="data" /> -->
  <div id="agreement">
    <div class="container">
      <h1>AnyTeach 用户协议</h1>
      <h2>协议的接受与变更</h2>
      <p>
        感谢您（以下亦称“用户”）使用 AnyTeach
        爱妮兔英语（以下简称“AnyTeach”）的产品和服务。请您在使用 AnyTeach
        服务或注册前充分阅读并且理解本协议。使用、购买我们的服务即代表您签署了本协议，表明您自愿接受本协议全部条款的约束，本协议将构成您与厦门市睿博东方文化传媒有限公司（以下简称“本公司”）及其经营的
        AnyTeach
        平台之间具有约束力的法律文件。如果您不同意我们的条款或政策，请立即停止使用。
      </p>
      <p>您同意本公司有权利对本协议进行修改，协议修改后，本公司将通过在相关页面公布修改的内容、通过您注册时提供的联系方式发送或者其他任何合理方式通知您，您同意承担及时阅读确认修改协议的义务。如果您不同意协议的修改，请立即停止访问或使用本网站或取消已经获得的服务；如果您选择在本协议修改后继续访问或使用本网站，则视为您已接受本协议的修改。</p>
      <p>您与本公司签署的本协议所列明的条款，并不能完全涵盖您与本公司所有的权利和义务。您同意本公司公布其他声明、规则等均视为本协议之补充协议，为本协议不可分割的组成部分，与本协议具有同等法律效力。</p>
      <h2>服务内容</h2>
      <p>
        AnyTeach
        的服务涵盖“直播课”、“王冰暗示法英语”、“同城拼课”、和“游学”等板块。AnyTeach
        不保证其提供的服务一定满足用户的全部需求，保留随时修改、中断或终止无偿提供的服务且无需通知用户的权利，且不承担任何责任。
      </p>
      <h2>用户义务</h2>
      <p>
        用户承诺遵守《中华人民共和国商标法》、《中华人民共和国著作权法》、《中华人民共和国广告法》、《中华人民共和国反不正当竞争法》、《中华人民共和国侵权责任法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》及《信息网络传播权保护条例》等有关法律、法规、规章的规定。在任何情况下
        AnyTeach
        合理地认为用户有可能违反上述法律、法规、规章的规定，有权不经事先通知终止向该用户提供服务。
      </p>
      <p>
        用户承诺并保证，用户在平台上传的文字、图片、视频、音频、多媒体资料或其他内容拥有相应合法的权利。上述文字、图片、视频、音频、多媒体资料或其他内容，不侵犯任何第三方的肖像权、名誉权、著作权、商标权等权利；不违反用户与第三方所签订的对用户有约束力的法律文件的规定；否则，AnyTeach
        有权对用户发布的信息依法或依据本协议进行删除或屏蔽，并有权不经事先通知终止向该用户提供服务。
      </p>
      <p>AnyTeach 禁止用户从事的行为包括但不限于：</p>
      <ul>
        <li>涉及危害国家安全、泄露国家秘密的；侵犯国家社会集体的和公民的合法权益的；制作、复制、发行或传播带有煽动抗拒、破坏法律、法规实施的，煽动颠覆国家政权，推翻社会主义制度的，煽动分裂国家、破坏国家统一的，煽动民族仇恨、民族歧视，破坏民族团结的，捏造或者歪曲事实，散布谣言，扰乱社会秩序的，宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的，公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的，损害国家机关信誉的，其他违反法律、法规的内容。</li>
        <li>冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关的。</li>
        <li>伪造标题或以其他方式操控识别资料，使人误认为该内容为 AnyTeach 所传送的。</li>
        <li>将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送。</li>
        <li>以技术方式攻击或破坏或改变平台的部分或全部、或干扰其运行；以非法方式获取或使用平台的任何软件、代码或其他技术或商业信息；禁止用户对平台运行的任何程序进行反向工程、反向编译、反向汇编或改写。</li>
        <li>
          未经许可使用平台的网站名称、公司名称、商标、商业标识、网页版式或内容、或其他由
          AnyTeach
          或平台享有知识产权或权利的信息或资料；将平台以任何形式作为从事各种非法活动的场所、平台或媒介。未经
          AnyTeach
          的书面授权或许可，用户不得以本公司的名义从事任何商业活动，也不得以任何形式将平台作为从事商业活动的场所、平台或媒介。
        </li>
        <li>
          未经 AnyTeach
          书面许可、另行签署协议或另行指定可供用户使用的特定商业服务外，用户不得以商业目的使用平台；不对平台的任何部分或全部进行商业性质利用、复制、拷贝、出售、调查、广告。
        </li>
        <li>
          未经 AnyTeach
          书面许可、另行签署协议或另行指定可供用户使用的特定商业服务外，用户不得通过平台发布有关任意第三方的广告宣传内容。用户就其所上传的内容承担全部法律责任。因用户违反法律规定或本协议规定造成违约或侵犯第三方合法权益的，由用户自行解决。如果给
          AnyTeach 平台造成损失，AnyTeach
          有权向用户追偿其因此所遭受的全部损失、包括其直接损失、间接损失、预期利益损失等损失。
        </li>
      </ul>
      <h2>知识产权归属与授权</h2>
      <p>
        AnyTeach
        爱妮兔英语对网站服务及本网站所使用的软件所包含的受知识产权法或其他法律保护的资料享有相应的权利，本网站的整体内容版权归
        AnyTeach 所有。
      </p>
      <p>
        本网站上包含的所有文字、图片、界面、照片、音视频内容和计算机代码
        (统称“内容”)，均由 AnyTeach 所有、控制或授权，或者授权给
        AnyTeach，并且受到商业外观、版权、专利和商标法以及各种其他知识产权和反不正当竞争法的保护。用户对本网站所使用的软件有非专属性使用权，但不得自行或许可任何第三方复制、修改、出售或衍生产品。
      </p>
      <p>
        经由本网站传送的文字、图片、音频、视频及其他内容，受到著作权法、商标法、专利法或其他法律的保护；除该文字、图片、音频、视频及其他内容的上载用户所享有的著作权，未经
        AnyTeach 书面授权许可，第三方不得进行修改、出租、售卖或衍生其他作品。 AnyTeach
        对其专有内容、原创内容和其他通过授权取得的独占或者独家内容享有知识产权。未经
        AnyTeach
        书面许可，任何单位和个人不得私自转载、传播和提供收听服务或者有其他侵犯
        AnyTeach 知识产权的行为。否则，将承担法律责任。
      </p>
      <h2>恶意行为</h2>
      <p>
        用户不得使用任何“深层链接”、“网页爬虫”、“网页机器人”、“网页采集工具”或其他自动设备、程序、算法或方法，或者任何类似或同等的手动流程来访问、获取、拷贝或监控本网站的任何组成部分或任何内容，或是以任何方式复制或规避本网站或本网站所含内容的导航结构或呈现形式，从而通过本网站并未有意提供的任何手段获取或试图获取任何资料、文稿或信息。AnyTeach
        保留禁止任何此类活动的权利。
      </p>
      <p>
        用户不得探测、扫描或测试本网站或与本网站连接的任何网络是否存在漏洞，也不得破坏本网站或与本网站连接的任何网络所采用的安全或身份验证措施。用户不得反向搜索、跟踪或试图跟踪有关本网站的任何其他用户或访客、或者
        AnyTeach 的任何其他顾客的任何信息 (包括不属于用户的 AnyTeach
        帐户)；不得滥用本网站或由本网站提供或通过本网站提供的任何服务或信息；也不得以任何形式泄露任何信息
        (包括但不限于个人身份或信息，但不包括本网站提供的用户的个人信息)。
      </p>
      <p>
        用户不得通过黑客攻击、破解密码或任何其他非法方式尝试在未经授权的情况下访问本网站的任何部分或功能，访问连接到本网站或任何
        AnyTeach 服务器的任何其他系统或网络，或者访问
        本网站上或通过本网站提供的任何服务。
      </p>
      <p>
        用户同意不采取任何会对本网站的基础架构或 AnyTeach
        系统或网络、或者连接到本网站或 AnyTeach
        的任何系统或网络带来不合理或不成比例的高负载的行为。
      </p>
      <p>用户同意不使用任何设备、软件或程序干扰或尝试干扰本网站或其上执行的任何事务的正常工作，也不干扰任何其他人使用本网站。</p>
      <p>
        用户不得伪造标头或以其他方式人为操控标识符，以伪装用户在本网站或其提供的任何服务上或者通过本网站和此类服务发送给
        AnyTeach
        的任何信息或传输的来源。用户不得假装自己是其他人或代表其他人，也不得冒充任何其他个人或实体。
      </p>
      <p>
        用户不得出于任何非法或本使用条款所禁止的目的使用本网站或其包含的任何内容，也不得唆使任何非法活动或其他侵犯
        AnyTeach 或他人权利的活动。
      </p>
      <h2>服务终止</h2>
      <p>
        AnyTeach
        有权在任何时候，基于任何原因，暂时或永久地终止本网站服务之全部或部分，而无需提前通知。AnyTeach
        对平台服务的终止对用户和任意第三人均无需承担任何责任。AnyTeach
        有权在任何时候，基于任何原因，暂时或永久地终止用户的账号、密码使用本网站服务，或删除、转移用户存储、发布在本网站的内容，而无需提前通知，且对用户和任意第三人均无需承担任何责任。
      </p>
      <h2>法律适用</h2>
      <p>
        本协议签订地为中华人民共和国福建省厦门市，协议的生效、履行、解释及争议的解决均适用中华人民共和国法律。用户因使用
        AnyTeach 平台而产生或与之相关的一切争议，均适用中华人民共和国法律。
      </p>
    </div>
    <div v-if="buttons" class="buttons">
      <el-button @click="$emit('agree', true)" type="primary" round class="button">同意协议</el-button>
      <!-- <el-link :underline="false" @click="logout()" class="link">不同意，退出登陆</el-link> -->
    </div>
  </div>
</template>

<script>
export default {
  props: {
    buttons: {
      type: Boolean,
      default: false
    }
  },
  data() {
    return {
      data: ""
    }
  },
  methods: {
    async getData() {
      const { value_1 } = await this.$api.api.CUSTOM("user_agreement_desktop")
      this.data = value_1
    },
  },
  created() {
    // this.getData()
  }
}
</script>

<style lang="scss">
#agreement {
  user-select: text;
  color: $color-plain;
  font-size: 13px;
  h1 {
    font-size: 25px;
    margin-top: 10px;
  }
  h2 {
    font-size: 18px;
  }
}
</style>
<style lang="scss" scoped>
#agreement {
  min-height: 90vh;

  .buttons {
    .button {
      margin: 30px auto 0 auto;
      display: block;
    }
  }
}
</style>